---
title: Cassandra. Часть 6. Batches
author: Дмитрий Шупляков
date: 2019-04-23 22:32:39
tags:
---
В реляционных базах есть возможность объединения запросов в батч (группу). Обработка таких запросов выполняется быстрее, 
т.к. отсутствует оверхед на передачу по сети множества отдельных запросов, плюс база данных более эффективно обрабатывает один 
большой но цельный запрос, чем несколько маленьких и разрозненных. В Кассандре батчи тоже есть, но основное предназначение их 
несколько другое.

<!-- more -->

Начнем с того, что батчи бывают двух видов: LOGGED BATCH и UNLOGGED BATCH 

## LOGGED BATCH 

Логгируемые батчи предназначены для обеспечения атомарности батча. То есть все запросы входящие в батч будут либо выполнены, либо нет.
На самом деле, если батч принят в работу, то откатиться он уже не сможет и будет гарантировано выполнен. Но ведь в момент выполнения 
батча нода может отказать, как же тогда достиагется эта гарантия? 

Рассмотри механизм работы logged батча:
- из приложения сформированный батч отправляется на выполнение в С*
- батч приходит на ноду-координатор, координатор сохраняет его у себя
- координатор копирует батч на 2 любых ноды
- координатор начинает выполнение батча
- после завершения выполенния батча, кординатор шлет batchlog delete message резеврным нодам для удалення копий батчей


Если координатор упал во время выполнения батча, используется механизм восстановления. Для этого, обе резервные ноды, 
кажду минуту сканируют таблицу batchlog, и если обнаруживают в ней батч живущий дольше,  
чем write_request_timeout*2, они начинают выполнять этот батч. 
Кассандра ограничивает размер батча, чтобы успевать уложиться в выделенный таймаут. 
Нормальный считается батч размером до 5 кб, батчи размеро свыше 50кб не выполняются. Параметры конфигурируются.


https://stackoverflow.com/questions/28348717/how-do-atomic-batches-work-in-cassandra/28348718#28348718
